#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
n = int(input("Введите десятичное число: "))
print(f'Двоинчное число из {n} = {bin(n)}')
